
def area(a):
    '''
    Возвращает площадь квадрата по длине его стороны.

        Параметры:
            a (int): длина стороны квадрата

        Возвращаемое значение:
            (int): площадь квадрата (сторона в квадрате)
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает perimeter квадрата по длине его стороны.

        Параметры:
            a (int): длина стороны квадрата

        Возвращаемое значение:
            (int): периметр квадрата (сторона умноженная на 4)
    '''
    return 4 * a
