
def area(a):
    '''
    Возвращает площадь квадрата по длине его стороны.

        Параметры:
            a (int/float): длина стороны квадрата

        Возвращаемое значение:
            area (int/float): площадь квадрата (сторона в квадрате)
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает perimeter квадрата по длине его стороны.

        Параметры:
            a (int/float): длина стороны квадрата

        Возвращаемое значение:
            perimeter (int/float): периметр квадрата (сторона умноженная на 4)
    '''
    return 4 * a
